---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeRoomBoundingOption
source: html/b102fe53-d044-819e-3639-bb0521cb232a.htm
---
# Autodesk.Revit.DB.DirectShapeRoomBoundingOption

An enumerated type containing possible room bounding settings for DirectShapes.

## Syntax (C#)
```csharp
public enum DirectShapeRoomBoundingOption
```